msalau/arduino-nRF5/cores/nRF5/wiring_analog.h
/*
  Copyright (c) 2015 Arduino LLC.  All right reserved.
  Copyright (c) 2016 Sandeep Mistry All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#pragma once

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#include "nrf.h"

/*
 * \brief nRF51 and nRF52 have different reference options.
 */
#if defined(NRF52_SERIES)
typedef enum _eAnalogReference
{
  AR_DEFAULT,
  AR_INTERNAL,
  AR_VDD4
} eAnalogReference ;
#else
typedef enum _eAnalogReference
{
  AR_DEFAULT,
  AR_VBG,
  AR_SUPPLY_ONE_HALF,
  AR_SUPPLY_ONE_THIRD,
  AR_EXT0,
  AR_EXT1
} eAnalogReference ;
#endif

#if defined(NRF52_SERIES)
/*
 * \brief Acquisition time enumeration. To be used with \ref analogAcquisitionTime
 */
typedef enum _eAcquisitionTime
{
  AT_DEFAULT,
  AT_3us,
  AT_5us,
  AT_10us,
  AT_15us,
  AT_20us,
  AT_40us
} eAcquisitionTime ;

/*
 * \brief Set the acquisition time of the ADC.
 * Default value: 3us.
 * Acquision time should match the maximum source resistance of the signal.
 * See the '37.9 Acquisition time' chapter of the datasheet for more details.
 *
 * <table>
 * <caption>Acquisition Time</caption>
 * <tr><th>Acquisition Time<th>Maximum source resistance
 * <tr><td>3us  <td>10kOhm
 * <tr><td>5us  <td>40kOhm
 * <tr><td>10us <td>100kOhm
 * <tr><td>15us <td>200kOhm
 * <tr><td>20us <td>400kOhm
 * <tr><td>40us <td>800kOhm
 * </table>
 *
 * \param ulMmode
 */
extern void analogAcquisitionTime( eAcquisitionTime ulMode );
#endif

/*
 * \brief Configures the reference voltage used for analog input (i.e. the value used as the top of the input range).
 * This function is kept only for compatibility with existing AVR based API.
 *
 * \param ulMmode Should be set to AR_DEFAULT.
 */
extern void analogReference( eAnalogReference ulMode ) ;

/*
 * \brief Writes an analog value (PWM wave) to a pin.
 *
 * \param ulPin
 * \param ulValue
 */
extern void analogWrite( uint32_t ulPin, uint32_t ulValue ) ;

/*
 * \brief Reads the value from the specified analog pin.
 *
 * \param ulPin
 *
 * \return Read value from selected pin, if no error.
 */
extern uint32_t analogRead( uint32_t ulPin ) ;

/*
 * \brief Set the resolution of analogRead return values. Default is 10 bits (range from 0 to 1023).
 *
 * \param res
 */
extern void analogReadResolution(int res);

/*
 * \brief Set the resolution of analogWrite parameters. Default is 8 bits (range from 0 to 255).
 *
 * \param res
 */
extern void analogWriteResolution(int res);

extern void analogOutputInit( void ) ;

#ifdef __cplusplus
}
#endif
